IOsonata/IOsonata/ARM/Nordic/nRF54/src/bt_app_bm.cpp
		case PM_EVT_STORAGE_FULL:
			// The IOsonata bt_pds store compacts itself on write, so unlike the
			// nRF52 fds_gc() path there is nothing to trigger here.
			break;

		case PM_EVT_PEERS_DELETE_SUCCEEDED:
			// Bonds cleared. Resume advertising if we are a peripheral.
			if (g_BtAppData.AppDevice.Conn.Role &
				(BTAPP_ROLE_PERIPHERAL | BTAPP_ROLE_BROADCASTER))
			{
				BtAdvStart();
			}
			break;

		default:
			break;
	}
}

// Initialize peer_manager and LESC. Maps the app SecType / key-exchange config
// onto ble_gap_sec_params_t exactly as the nRF52 port does (the BTAPP_SECTYPE_*
// values alias the same BT_GAP_SECTYPE_* the nRF52 BLEAPP_SECTYPE_* use).
static uint32_t BtAppPeerMngrInit(BTGAP_SECTYPE SecType, uint8_t SecKeyExchg, bool bEraseBond)
{
	ble_gap_sec_params_t sec_param;
	uint32_t err_code;

	err_code = pm_init();
	if (err_code != NRF_SUCCESS)
	{
		DEBUG_PRINTF("pm_init failed: 0x%x\r\n", err_code);
		return err_code;
	}

	if (bEraseBond)
	{
		(void)pm_peers_delete();
	}

	memset(&sec_param, 0, sizeof(sec_param));

	sec_param.bond           = 1;
	sec_param.min_key_size   = BT_APP_SEC_PARAM_MIN_KEY_SIZE;
	sec_param.max_key_size   = BT_APP_SEC_PARAM_MAX_KEY_SIZE;
	sec_param.kdist_own.enc  = 1;
	sec_param.kdist_own.id   = 1;
	sec_param.kdist_peer.enc = 1;
	sec_param.kdist_peer.id  = 1;

	switch (SecType)
	{
		case BTGAP_SECTYPE_NONE:
		case BTGAP_SECTYPE_STATICKEY_NO_MITM:
			break;
		case BTGAP_SECTYPE_STATICKEY_MITM:
			sec_param.mitm = 1;
			break;
		case BTGAP_SECTYPE_LESC_MITM:
			sec_param.mitm = 1;
			sec_param.lesc = 1;
			break;
		case BTGAP_SECTYPE_SIGNED_NO_MITM:
			sec_param.lesc = 1;
			break;
		case BTGAP_SECTYPE_SIGNED_MITM:
			sec_param.mitm = 1;
			sec_param.lesc = 1;
			break;
		default:
			break;
	}

	int exchg = SecKeyExchg & (BTAPP_SECEXCHG_KEYBOARD | BTAPP_SECEXCHG_DISPLAY);
	switch (exchg)
	{
		case BTAPP_SECEXCHG_KEYBOARD:
			sec_param.keypress = 1;
			sec_param.io_caps  = BLE_GAP_IO_CAPS_KEYBOARD_ONLY;
			break;
		case BTAPP_SECEXCHG_DISPLAY:
			sec_param.io_caps  = BLE_GAP_IO_CAPS_DISPLAY_ONLY;
			break;
		case (BTAPP_SECEXCHG_KEYBOARD | BTAPP_SECEXCHG_DISPLAY):
			sec_param.keypress = 1;
			sec_param.io_caps  = BLE_GAP_IO_CAPS_KEYBOARD_DISPLAY;
			break;
		default:
			break;
	}

	if (SecKeyExchg & BTAPP_SECEXCHG_OOB)
	{
		sec_param.oob = 1;
	}

	err_code = pm_sec_params_set(&sec_param);
	if (err_code != NRF_SUCCESS)
	{
		DEBUG_PRINTF("pm_sec_params_set failed: 0x%x\r\n", err_code);
		return err_code;
	}

	err_code = pm_register(BtAppPmEvtHandler);
	if (err_code != NRF_SUCCESS)
	{
		DEBUG_PRINTF("pm_register failed: 0x%x\r\n", err_code);
		return err_code;
	}

	// Provide the LESC layer its crypto engine. The App owns the CryptoDev_t
	// instance and injects it, mirroring the BtSmpInit model on the SDC port.
	// Software P-256 today (CryptoUeccInit); a hardware-backed engine can be
	// injected here later with no change to the LESC code. RNG underneath comes
	// from the CRACEN-backed RngGet via crypto_uecc.
	static CryptoDev_t s_LescEcdh;
	CryptoUeccInit(&s_LescEcdh);
	BtLescSetCryptoEngine(&s_LescEcdh);

	err_code = nrf_ble_lesc_init();
	if (err_code != NRF_SUCCESS)
	{
		DEBUG_PRINTF("nrf_ble_lesc_init failed: 0x%x\r\n", err_code);
		return err_code;
	}

	return NRF_SUCCESS;
}

/**
 * @brief Initialize the Bluetooth application.
 *
 * This function initializes the SoftDevice, BLE stack, GAP parameters,
 * GATT services, advertising, and security.
 */
bool BtAppInit(const BtAppCfg_t *pCfg)
{
	uint32_t err_code;

	// Initialize application event handler
	if (AppEvtHandlerInit(pCfg->pEvtHandlerQueMem, pCfg->EvtHandlerQueMemSize) == false)
	{
		return false;
	}

	// Populate internal app data from config
	g_BtAppData.AppDevice.Conn.Role = pCfg->Role;
	g_BtAppData.AdvHdl = BLE_GAP_ADV_SET_HANDLE_NOT_SET;
	if (!BtPeerInit(pCfg->pPeerPoolMem, pCfg->PeerPoolMemSize))
	{
		return false;
	}

	// Split the long-write reassembly pool across the peer slots so each
	// link gets its own buffer (per Conn.pLongWrBuff).
	BtPeerLongWrInit(pCfg->pLongWrPoolMem, pCfg->LongWrPoolMemSize);

	// Connection pool removed: the peer manager (BtPeerInit above) owns
	// the single connection table now.
	// bExtAdv is no longer a config field; BtAdvEncode determines extended vs
	// legacy from the encoded payload and sets g_BtAppData.bExtAdv during
	// BtAppAdvInit.
	g_BtAppData.ConnLedPort = pCfg->ConnLedPort;
	g_BtAppData.ConnLedPin = pCfg->ConnLedPin;
	g_BtAppData.ConnLedActLevel = pCfg->ConnLedActLevel;
	g_BtAppData.bScan = false;
	g_BtAppData.AppDevice.VendorId = pCfg->VendorId;
	g_BtAppData.AppDevice.ProductId = pCfg->ProductId;
	g_BtAppData.AppDevice.ProductVer = pCfg->ProductVer;
	g_BtAppData.AppDevice.Appearance = pCfg->Appearance;

	g_BtAppData.AppDevice.Conn.MaxMtu = GATT_MTU_SIZE_DEFAULT;
	if (pCfg->MaxMtu > GATT_MTU_SIZE_DEFAULT)
		g_BtAppData.AppDevice.Conn.MaxMtu = pCfg->MaxMtu;

	// Setup connection LED
	if (pCfg->ConnLedPort != -1 && pCfg->ConnLedPin != -1)
	{
		IOPinConfig(pCfg->ConnLedPort, pCfg->ConnLedPin, 0,
					IOPINDIR_OUTPUT, IOPINRES_NONE, IOPINTYPE_NORMAL);
		BtAppConnLedOff();
	}

	// Initialize SoftDevice + BLE stack
	if (BtAppStackInit(pCfg) == false)
	{
		DEBUG_PRINTF("BtAppStackInit failed\r\n");
		return false;
	}


	// Set GAP appearance
	err_code = sd_ble_gap_appearance_set(pCfg->Appearance);
	(void)err_code;

	// Initialize GAP parameters
	BtGapCfg_t gapcfg = {
		.Role = pCfg->Role,
		.SecType = pCfg->SecType,
		.AdvInterval = pCfg->AdvInterval,
		.AdvTimeout = pCfg->AdvTimeout,
		.ConnIntervalMin = pCfg->ConnIntervalMin,
		.ConnIntervalMax = pCfg->ConnIntervalMax,
		.SlaveLatency = BT_GAP_CONN_SLAVE_LATENCY,
		.SupTimeout = BT_GAP_CONN_SUP_TIMEOUT
	};

	BtGapInit(&gapcfg);

	if (pCfg->pDevName != NULL)
	{
		BtGapSetDevName(pCfg->pDevName);
	}

	// Register connection parameters event handler
	ble_conn_params_evt_handler_set(on_conn_params_evt);

	// Initialize user services
	DEBUG_PRINTF("BtAppInit: Role=0x%x PERIPHERAL=%d\r\n",
		pCfg->Role, (pCfg->Role & BTAPP_ROLE_PERIPHERAL) ? 1 : 0);
	if (pCfg->Role & BTAPP_ROLE_PERIPHERAL)
	{
		DEBUG_PRINTF("BtAppInit: calling BtAppInitUserServices\r\n");
		BtAppInitUserServices();
	}

